Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ལོ་ནི་ལེགས། སྐྱེ་བོ་མང་པོས་ནི་གང་།
en: There were bountiful harvests, and the land filled with beings.

source: དགེ་བ་ནི་སྤྱོད། སྐྱེ་བོས་ནི་བརྒྱན།
en: Everyone conducted themselves virtuously, and the land was adorned with beings.

source: དུག་གི་ཤིང་དང་ནི་བྲལ། བདུད་རྩིའི་ཤིང་གིས་ནི་ཁེབས།
en: There were no poisonous plants, but an abundance of ambrosial plants.

source: ལག་མཐིལ་ལྟར་མཉམ་པར་ནི་གྱུར། འདོད་པའི་འབྲས་བུའི་ཤིང་ཐམས་ཅད་ཀྱིས་ནི་ཁེབས་ཏེ།
en: The land was as flat as the palm of a hand, and filled with all kinds of tantalizing fruit trees.

source: འདི་ལྟ་སྟེ་དཔེར་ན་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་བཞིན་ནོ། །
en: In this manner it was similar to the Heaven of the Thirty-Three.

source: དེ་ནས་རྒྱལ་པོ་ཕུར་བུའི་ལྷ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Once, King Bṛhaspatideva found himself pondering,

source: བདག་ལ་རྒྱལ་སྲིད་ནི་ཆེར་ཡོད། སྐྱོན་དང་ནི་བྲལ། ཡོན་ཏན་ཐམས་ཅད་དང་ནི་ལྡན།
en: ‘I have this vast, immaculate kingdom, excellent in every respect;

source: སློངས་མོ་པ་ནི་མེད་དེ་དེ་ལྟ་མོད་ཀྱི་འདི་དག་ནི་བདག་གིས་བྱ་བ་ཡིན་ཏེ།
en: indeed there are not even any beggars. All of this I have created.

source: མིའི་འཇིག་རྟེན་དུ་སྐྱེས་པས་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་ཡང་དག་པར་འགྲུབ་པའི་ལམ་ཡོངས་སུ་སྦྱང་བར་བྱ།
en: Now that I have been born in this human realm, I should train in the path leading to the attainment of the higher realms.

source: འཕགས་པའི་སྐྱེ་བོ་དང་ལྷན་ཅིག་འགྲོགས་པ་བཙལ་བར་བྱ།
en: I should seek out the companionship of a noble being.

source: འོ་ན་བདག་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པའི་མཆོད་སྦྱིན་བྱའོ་སྙམ་ནས།
en: Moreover, I should perform an extraordinary offering ceremony.’

source: བྲམ་ཟེ་མདུན་ན་འདོན་ལ་སྨྲས་པ།
en: “He told his court chaplain,

source: བྲམ་ཟེ་ང་ནི་མཆོད་སྦྱིན་དང་རྗེས་སུ་འཐུན་པར་འདོད་དེ། ཆོས་ཀྱིས་ཕྱིར་རྒོལ་བ་ནི་བཅོམ།
en: ‘O brahmin, I want to perform a suitable offering ceremony that will subdue those who oppose the Dharma,

source: ཆོས་ཀྱིས་ཚེར་མ་ནི་དཀྲུགས།
en: agitate spiritual adversaries,

source: ཆོས་ཀྱིས་ཀླ་ཀློ་དེ་དག་ནི་ཕྱུང་།
en: cast out the spiritual barbarians, and

source: ཡོ་བྱད་ཐམས་ཅད་དང་ནི་ལྡན་པས་
en: bring every type of material necessity.

source: བདག་མཆོད་སྦྱིན་བྱེད་འདོད་ན་བདག་ལ་མཆོད་སྦྱིན་བྱ་བ་དག་རྗེས་སུ་སྟོན་ཅིག །
en: Since I wish to perform such a ceremony, please show me how.’

source: དེས་སྨྲས་པ་
en: “The brahmin replied,

source: རྒྱལ་པོ་ཆེན་པོ་མཆོད་སྦྱིན་གྱི་བགྱི་བ་དེ་དག་བསྡུར་གསོལ། །
en: ‘Your Majesty, please perform the offering ceremony accordingly.

source: རྒྱལ་པོ་ཆེན་པོ་འདིར་མཆོད་སྦྱིན་ལ་སེམས་ཅན་སྣ་ཚོགས་དག་འདུག་སྟེ།
en: Your Majesty, as you perform this offering ceremony, keep in mind there are a variety of beings.

source: ཁ་ཅིག་ནི་རླུང་གི་རང་བཞིན་ཅན་ཁ་ཅིག་ནི་མཁྲིས་པའི་རང་བཞིན་ཅན། ཁ་ཅིག་ནི་བད་ཀན་གྱི་རང་བཞིན་ཅན། ཁ་ཅིག་ནི་འདུས་པའི་རང་བཞིན་ཅན་ཏེ།
en: Some are of a constitution dominated by wind, others have a nature marked by bile, and yet others are of a disposition dominated by phlegm; still others are of mixed disposition.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་དག་ལ་དེ་དང་འཐུན་པའི་ཁ་ཟས་ཀྱི་རྣམ་པ་སོ་སོར་སྩལ་བར་བཀའ་སྩལ་དུ་གསོལ།
en: Your Majesty, you should provide specific kinds of appropriate food to each of these groups.’

source: དེ་ནས་རྒྱལ་པོ་ཕུར་བུའི་ལྷས་བྲམ་ཟེ་མདུན་ན་འདོན་གྱི་ལྟར་མཉན་ནས་མཆོད་སྦྱིན་གྱི་ཡོ་བྱད་དག་བསགས་ནས།
en: “King Bṛhaspatideva listened carefully to what his court chaplain said, and then gathered the offerings accordingly.

source: མཆོད་སྦྱིན་ཆེན་པོ་དེ་ལ་བྲམ་ཟེ་ཁྲི་ཕྲག་བརྒྱད་ཅུ་དག་འདུས་པར་གྱུར་ཏོ། །
en: Eight hundred thousand brahmins assembled to take part in the offering ceremony

source: དེ་དག་ཡིད་བཞིན་དུ་འགྲུབ་པར་འགྱུར་ཏེ།
en: and each had his wishes fulfilled.

source: ཡིད་བཞིན་དུ་ཚོད་མ་དང་། ཡིད་བཞིན་དུ་རིམ་གྲོ་པ་རྣམས་ཀྱིས་རིམ་གྲོར་བྱས།
en: Each had his heart’s content of vegetables, while attendants carried out the ceremonies to fulfill everyone’s wishes.

source: མཆོད་སྦྱིན་ཆེན་པོ་དེ་ལ་ཕལ་ཆེར་གསེར་གྱི་སྣོད་ཀྱི་ནང་ནས་འདྲིམ་སྟེ།
en: The immense offerings were mostly distributed inside dishes of gold.

source: བྲམ་ཟེ་གང་ལ་སྣོད་གང་ཕུལ་བ་དེ་དེ་ཉིད་ལ་འབུལ་བར་བྱེད་དོ། །
en: Each brahmin was offered an appropriate dish,

source: མཆོད་སྦྱིན་ཆེན་པོ་དེ་ལ་གསེར་གྱི་སྟན་ཕལ་ཆེར་བཏིང་ཞིང་མཆོད་སྦྱིན་དེ་ལ་བུད་མེད་དག་གིས་འདྲིམ་པར་བྱེད་དེ།
en: while the majority of the offering ceremony was arranged on a golden platform, and women carried out the distribution of gifts.

source: བྲམ་ཟེ་རེ་རེ་ལ་བུད་མེད་རེ་རེས་འདྲིམ་མོ། །
en: A different woman distributed a gift to each brahmin,

source: བྲམ་ཟེ་གང་ལ་བུད་མེད་འདྲིམ་པ་དེ་ཉིད་དེ་ལ་འབུལ་ཏེ།
en: with each woman making a particular offering to each brahmin.

source: གལ་ཏེ་འདོད་ན་ནི་ལེན་པར་བྱེད། གལ་ཏེ་མི་འདོད་ན་ནི་མི་ལེན་ཏོ། །
en: They were allowed to accept what they liked or leave what they did not.

source: གང་འདོད་ན་ནི་ལོངས་སྤྱོད་དེ་ཐམས་ཅད་ལེན་པར་བྱེད། མི་འདོད་ན་ནི་ལེན་པར་མི་བྱེད་དོ། །
en: Each enjoyed to the utmost whatever he liked and could refuse whatever he did not like.

source: མཆོད་སྦྱིན་ཆེན་པོ་དེ་ལོ་ཁྲིའི་བར་དུ་བྱས་ཏེ་ལོ་ཁྲིའི་བར་དུ་མཆོད་སྦྱིན་འཐུན་པ་དེ་ལས་སེམས་ཅན་གང་ཐན་པ་བཞོ་བ་ཙམ་གྱི་བར་དུ་ཡང་ནད་ཀྱིས་མ་བཏབ་བོ། །
en: The immense offering ceremony went on for ten thousand years, and for the entirety of those ten thousand years this suitable offering ceremony ensured that no one, not even the lowliest milkmaid, got sick.

source: དེ་ལྟར་ན་ངའི་སྤྱོད་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་འདོད་པ་དང་། ཡོན་གནས་སུ་འདུ་ཤེས་ཉེ་བར་བཞག་ནས་མཆོད་སྦྱིན་བྱས་སོ། །
en: “In this way I carried out the offering ceremony out of my wish to help all sentient beings, considering them all to be worthy recipients.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཕུར་བུའི་ལྷ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Maudgalyāyana, in case you may think that at that time King Bṛhaspatideva was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཕུར་བུའི་ལྷ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Bṛhaspatideva.

source: དགེ་བའི་རྩ་བ་དེས་ངས་ཁམས་དུ་མ་ཤེས་པ་ཡང་བརྙེས། ངས་ཁམས་ཀྱི་མཉམ་པ་ཉིད་ཀྱང་བརྙེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁམས་དུ་མ་ཤེས་པ་ཡང་བརྙེས། ངས་གནོད་པ་ཉུང་བ་ཡང་བརྙེས་སོ། །
en: Due to those roots of virtue, I attained knowledge of the several elements, knowledge of the equality of the elements, knowledge of the several elements of all sentient beings, and freedom from disease.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཁམས་དུ་མ་ཤེས་པ་ལ་གནས་ཏེ་
en: Therefore, Maudgalyāyana, bodhisattva great beings who wish to fully awaken to unexcelled and perfect buddhahood should adhere to knowledge of the several elements.

source: དེའི་ཁམས་དང་ཀུན་འབྱུང་བ་རྒྱུ་གང་གིས་ཁམས་དུ་མ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་ཐོབ་པ་བརྟག་པར་བྱའོ། །
en: They must discern how knowledge of the origin and knowledge of the several elements are attained based upon the causes of the elements and their origin.

source: མཽད་གལ་གྱི་བུ་དེ་ལངས་ལས་ཤེས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: “Maudgalyāyana, I fully awakened by understanding karma.

source: རྒྱུ་དེས་ན་ལས་འདི་མངོན་པར་འདུས་བྱས་ཤིང་།
en: I thought, ‘Based on that cause, this karma was created.

source: བྱ་བ་འདི་སྤངས་པས་ཤེས་པ་འདི་ཡང་དག་པར་གྲུབ་བོ། །
en: And by abandoning this action, this knowledge is attained.’

source: བསམ་པ་འདིས་ན་སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ཉོན་མོངས་པ་གང་དང་གང་དག་གིས། གནོད་པའི་སེམས་ཅན་ཁ་ཅིག་ནི་འདོད་ཆགས་ཀྱི་ཁམས་སུ་གནས། ཁ་ཅིག་ནི་ཞེ་སྡང་གི་ཁམས་སུ་གནས། ཁ་ཅིག་ནི་གཏི་མུག་གི་ཁམས་སུ་གནས་པ་ལ་ང་སྙིང་རྗེ་ཆེན་པོས་ནོན་ཏོ་
en: Thinking in this way, I have been overwhelmed by compassion for those who dwell in realms of desire, those who dwell in realms of anger, and those who dwell in realms of ignorance, no matter which of the various afflictions affect sentient beings in their suffering.

source: དེ་ལྟར་ཉོན་མོངས་པ་གང་དང་གང་དག་གིས་ཉོན་མོངས་པའི་སེམས་ཀྱིས་ལས་དེ་མངོན་པར་འདུས་བྱས་ཤིང་། ཁམས་དེ་དང་དེ་ཉིད་ཀྱིས་དེ་མི་འགྱུར་བར་བསྟན་ཏེལ་ལ་ནི་སེར་པོ། ལ་ལ་ནི་ནག་པོ། ལ་ལ་ནི་དམར་པོ། ལ་ལ་ནི་བྱ་ཙ་གོ་རའི་མིག་ཅན། ལ་ལ་ནི་ཁྲུང་ཁྲུང་གི་མིག་ཅན། ལ་ལ་ནི་རིང་། ལ་ལ་ནི་ཐུང་། ལ་ལ་ནི་བར་མ་སྟེ། ལས་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Likewise, I have explained the various afflictions that lead to afflicted states of mind and the corresponding creation of karma, as well the various elements due to which they do not come about. Whether they may be yellow, black, red, with eyes like a partridge, with eyes like a crane, tall, short, or of medium height—I have understood the karma for each correctly.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོའི་བུ་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་འདོད་པ། བདེ་བར་འདོད་པ་གྲུབ་པ་དང་བདེ་བར་འདོད་པ། ཐབས་མཁས་པ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a prince named Kāruṇika. He was skillful and sought to help and bring about the welfare and happiness of all beings.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ་
en: Once he wondered to himself,

source: སེམས་ཅན་འདི་དག་གང་གིས་ན་ཁ་དོག་སྣ་ཚོགས་ཉིད་དུ་སྣང་། དབྱིབས་སྣ་ཚོགས་ཉིད་དང་། སྐད་སྣ་ཚོགས་ཉིད་དུ་སྣང་། དགེ་བ་སྣ་ཚོགས་ཉིད་དུ་སྣང་། རིགས་སྣ་ཚོགས་ཉིད་དུ་སྣང་། རུས་སྣ་ཚོགས་ཉིད་དུ་སྣང་། མིང་སྣ་ཚོགས་ཉིད་དུ་སྣང་བའི་རྒྱུ་ནི་གང་ཡིན་རྐྱེན་ནི་གང་ཡིན་སྙམ་མོ། །
en: ‘What makes these sentient beings appear in so many different colors, in so many different shapes, making so many different sounds, with their various virtues, various classes, various family lines, and various names? What are the causes and conditions that lead to this?’

source: ད་ལྟར་བྱུང་བ་ལ་ཤེས་པ་མེད་པས་ནི་མི་ནུས་ཏེ།
en: “Yet, since he had no knowledge of the present, he was unable to answer.

source: འཇིག་རྟེན་ན་དགེ་སྦྱོང་དང་།
en: He then thought,

source: བྲམ་ཟེ་གང་བདག་གི་དོན་དེ་ལུང་སྟོན་པ་སུ་ཡོད་སྙམ་ནས།
en: ‘What mendicant or brahmin could explain this matter?’

source: དེ་ཤེས་པ་དེ་བཙལ་བའི་དོན་དུ་ཕྱོགས་བཅུར་མི་བཀྱེ་སྟེ་ཁྱོད་སོང་ལ་ཤེས་པར་གྱིས་ཤིག །
en: In pursuit of this knowledge he sent men everywhere in the ten directions, ordering them,

source: འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ་བྲམ་ཟེའམ། སློབ་དཔོན་ནམ། སློབ་དཔོན་གྱི་བུ་གང་དོན་འདི་ཁྲོལ་བ་དང་། གང་བདག་གི་ཐེ་ཚོམ་སེལ་བ་སུ་ཡོད།
en: ‘Please go find out: in this world what mendicant, brahmin, teacher, or teacher’s son understands this matter and can eliminate my doubts about it?’

source: དེ་ནས་གཞོན་ནུ་དེའི་ཕར་གྱུར་པ་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པ་ཞེས་བྱ་བ་དེས་བུ་དེ་ལ་སྨྲས་པ།
en: “The prince’s father, King Susthita, then told him,

source: གཞོན་ནུ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་སེམས།
en: ‘My son, what you have in mind is inconceivable.

source: བཅོལ་གྱིས་མི་ཁྱབ་པ་ལ་འཆོལ་ཏེ།
en: What you have entrusted them to do is unfeasible.

source: གཞོན་ནུ་ཁྱོད་བསམ་པ་འདིས་བདག་ཉིད་ཉོན་མོངས་པར་འགྱུར་རྒྱལ་པོ་ཡང་འཁྲུགས་པར་འགྱུར།
en: Son, your contemplations will merely disturb you and disturb the king as well.

source: བསམ་གྱིས་མི་ཁྱབ་པ་འདི་མཐར་ཡང་མི་ཕྱིན་ནོ། །
en: You will never come to a conclusion about something that is inconceivable.

source: གཞོན་ནུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why do I say this, my son?

source: དྲི་བ་འདི་དག་གི་ལན་ལྡོན་པ་མེད་དོ། །
en: Because there are no answers to these questions.

source: གཞོན་ནུ་རྒྱལ་སྲིད་ལ་དགའ་བར་བྱོས།
en: Please just enjoy the kingdom—

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མངོན་པར་འདོད་པའི་དབང་ཕྱུག་ལ་དགའ་བར་བྱོས།
en: revel in the entire world as a lord of pleasures.

source: གཞོན་ནུ་དོན་བཏང་སྟེ་དོན་མེད་པ་སེམས་པ་ནི་ཉོན་མོངས་ཤིང་ངལ་བའི་སྐལ་བར་འགྱུར་རོ། །
en: But give up your pursuit, my son—thinking of such meaningless things will only make you tired and disturbed!’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། གཞོན་ནུ་སྙིང་རྗེ་ཅན་གྱིས་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “Prince Kāruṇika then addressed King Susthita, saying, ‘

source: རྒྱལ་པོ་ཆེན་པོ་མུན་པ་མི་སྣང་བ་ལ་མི་སྣང་བ་མ་མཛད་ཅིག །
en: Your Majesty, please do not let the dense darkness remain that way!

source: ཁྱོད་ཀྱི་ཡུལ་ན་དགའ་བ་ནི་མདོག་ཕུན་སུམ་ཚོགས་པ་དང་། མདོག་ངན་པ་དང་། ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་དང་། གཟུགས་བཟང་བ་དང་། གཟུགས་ངན་པ་དང་། རིགས་ཕུན་སུམ་ཚོགས་པ་དང་། རིགས་ངན་པ་དང་། ནོར་ཕུན་སུམ་ཚོགས་པ་དང་། དབུལ་བ་དང་། གླེན་པ་དང་། མཛངས་པ་དང་། དེ་བཞིན་དུ་བཟོ་རྣམ་པ་དུ་མ་ངག་ཁོད་དུ་ཆུད་པ་དང་། བཟོ་དག་མཆིས་ཤིང་བཟོ་དག་སློབ་པ་དང་། དབུལ་བ་དག་མཆིས་ཤིང་འབད་ན་ལོངས་སྤྱོད་རྙེད་པ་དང་། ནད་པ་མཆིས་ཤིང་བགྱི་བ་དག་གིས་ནད་ལས་ལྡང་བ་དག་མཆིས་ཏེ
en: The subjects in your land include people of lovely color, ugly color, and some that are perfect in every regard. They include beautiful people and ugly ones, people of high class and low class, rich people and poor people, foolish people and clever ones, people who know a variety of trades, those who have a craft and those who are learning one, people who are poor at first but later become rich through effort, and people who are ill and then recover from their illness.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་རྣམ་གྲངས་འདིས་ན་འདི་ལྟར་རིག་པར་བགྱི་སྟེ། ཆོས་དེ་དག་གི་རྒྱུ་ནི་མཆིས་ན་དེ་བདག་གིས་མི་འཚལ་ཏེ།
en: Your Majesty, it should be understood in this way and in this manner. If these things have causes, I do not know them.

source: རྒྱལ་པོ་ཆེན་པོ་གང་བདག་མི་འཚལ་བ་དེ་མ་མཆིས་པ་ནི་མ་ལགས་ཏེ།
en: Your Majesty, my lack of knowledge of something does not mean that it does not exist.

source: བདག་བཟོ་མང་པོ་མ་འཚལ་ཅིང་། གང་ཤེས་པ་དེ་བཟོ་གཞན་དག་མཆིས་པས་ཀྱང་མི་འཚལ་ལོ། །
en: There are many trades I do not know, and what I do understand is not always known to those of other trades.

source: རྒྱལ་པོ་ཆེན་པོ་ཤེས་པ་དེ་ནི་མཆིས་ཏེ། བདག་གིས་ཀྱང་ཤེས་པ་དེ་མ་འཚལ་ཏོ། །
en: Such knowledge does exist, Your Highness, and yet I do not possess it.

source: དེ་ལྟ་བས་ན་དགེ་སྦྱོང་དང་བྲམ་ཟེ་མཛངས་ཤིང་ཀུན་གྱིས་བཀུར་བ་ཤེས་རབ་དང་བཅས་པ་ཀུན་གྱིས་བཀུར་བ་དེ་ལ་ཡོངས་སུ་ཞུ་བར་བགྱིའོ། །
en: Therefore, I am asking my questions to wise and well-respected mendicants and brahmins, to those whose insight is well respected.’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པས་གཞོན་ནུ་སྙིང་རྗེ་ཅན་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Susthita then replied to Prince Kāruṇika,

source: གཞོན་ནུ་དེའི་ཕྱིར་མཛངས་པ་ཀུན་གྱིས་བཀུར་བ། ཤེས་རབ་དང་བཅས་པ་ཀུན་གྱིས་བཀུར་བ། དགེ་སྦྱོང་དང་བྲམ་ཟེ་དེ་ལ་ཡང་ཡོངས་སུ་ཞུས་ཤིག །
en: ‘My son, by all means, go ahead and ask your questions to those mendicants and brahmins whose wisdom is well respected and whose insight is well respected.’

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་ཅེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “At that time there lived in the world a thus-gone, worthy, perfect buddha named Jyotiṣprabhā; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: གཞོན་ནུ་སྙིང་རྗེ་ཅན་གྱི་བར་སྣང་ལས་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་བ་བཞུགས་ཏེ། དེ་ཞུ་བ་འདི་དག་གི་དོན་ལུང་སྟོན་པར་འགྱུར་རོ་ཞེས་སྒྲ་ཐོས་སོ། །
en: Once, Prince Kāruṇika heard a voice in the sky saying, ‘The thus-gone called Jyotiṣprabhā is living in the world and will answer your questions!’

source: དེ་ནས་གཞོན་ནུ་སྙིང་རྗེ་ཅན་དེའི་མཚན་མོ་འདས་ནས་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: So when the night was over, Prince Kāruṇika went before King Susthita and told him,

source: རྒྱལ་པོ་ཆེན་པོ་གང་མཁྱེན་པར་མཛོད་ཅིག །
en: ‘Your Majesty, you should know this:

source: རྒྱལ་པོ་ཆེན་པོ་བདག་མཚན་མོ་འདི་ལ་མཆིས། །ཉལ་བ་ན་བར་སྣང་ལས་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་བ་བཞུགས་ཏེ། དེ་ཞུ་བ་འདི་དག་གི་དོན་དུ་ལུང་སྟོན་པར་འགྱུར་རོ་ཞེས་སྒྲ་ཐོས་ལགས་སོ། །
en: Your Majesty, last night while I was sleeping, I heard a voice in the sky saying, “The thus-gone called Jyotiṣprabhā is living in the world and will answer your questions!” ’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། རྒྱལ་པོ་ཤིན་ཏུ་གནས་པས་གཞོན་ནུ་སྙིང་རྗེ་ཅན་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Susthita then replied to Prince Kāruṇika,

source: གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་དེ་ཕྱོགས་གང་ན་བཞུགས།
en: ‘My son, where does this thus-gone one named Jyotiṣprabhā live?’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་ཀྱིས་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པ་དེའི་སེམས་ཀྱི་བསམ་པ་དང་། ཡོངས་སུ་རྟོག་པ་མཁྱེན་ནས།
en: At that moment the thus-gone Jyotiṣprabhā was aware of what King Susthita was thinking and wondering.

source: ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་ཐམས་ཅད་དང་ལྡན་པ་ཤར་ཕྱོགས་སྣང་བར་མཛད་དོ། །
en: Manifesting the miraculous powers he had, he miraculously illuminated the entire eastern region.

source: གཞོན་ནུ་སྙིང་རྗེ་ཅན་དང་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐར་འོད་དེ་མཐོང་སྟེ། འོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་ལྡན་པ་སྣང་བར་མཛད་པ་ཡང་མཐོང་ནས།
en: Prince Kāruṇika and King Susthita then beheld the Blessed One, the thus-gone, worthy, perfect buddha Jyotiṣprabhā, and due to the light, they could also see his entire buddha realm.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་ལ་སེམས་དད་པར་གྱུར་ཏོ། །
en: They felt faith in the blessed thus-gone Jyotiṣprabhā.

source: དེ་སེམས་དད་ནས་གཞོན་ནུ་སྙིང་རྗེ་ཅན་དང་། སྲོག་ཆགས་ཁྲི་ཕྲག་དྲུག་ཅུ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: With such faith in their hearts, Prince Kāruṇika went before the thus-gone Jyotiṣprabhā along with six hundred thousand other beings.

source: དེ་བཞིན་གཤེགས་པ་སྐར་འོད་དེའི་སྤྱན་སྔར་ཞེས་ཆེ་བ་རབ་ཏུ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Paying great reverence to the thus-gone Jyotiṣprabhā, they sat off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། གཞོན་ནུ་སྙིང་རྗེ་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Sitting off to one side, Prince Kāruṇika then sang his questions to the Blessed One in song:

source: སྟོན་པ་དཔེ་མེད་སེམས་ཅན་རྣམས་ཀྱི་མགོན། །གསོ་བའི་དཔྱད་ལ་མཁས་ལ་ཞུ་བགྱི་བ། །ཇི་ལྟར་སེམས་ཅན་སྣ་ཚོགས་དག་གི་ཁམས། །མཚན་ཉིད་མི་འདྲར་གྱུར་པ་འདྲེན་པས་གསུངས། །
en: “ ‘Peerless Teacher, guardian of beings, I ask you who are skilled in healing, Please explain, O Guide, why do different beings Have such a variety of elements and traits?

source: མདོག་དང་དབྱིབས་དང་རིགས་ནི་ཕུན་སུམ་ཚོགས། །སྐྱེ་དང་རུས་དང་སྒྲ་ཡང་ཕུན་སུམ་ཚོགས། །མིང་ཡང་གང་གིས་སྣ་ཚོགས་ཐ་དད་པའི། །ཁྱད་པར་ཐུབ་པ་ཆེན་པོ་འདྲེན་པས་གསུངས། །
en: “ ‘Please explain, Great Sage and Guide, Why is there such a variety— The abundance of different colors, shapes, and castes, Births, classes, sounds, and names?

source: མདོག་དང་དབྱིབས་དང་རིགས་ནི་ཕུན་སུམ་ཚོགས། །སྐྱེ་དང་རུས་དང་སྒྲ་ཡང་ཕུན་ཚོགས་དག །ཐམས་ཅད་མཁྱེན་པའི་མཁྱེན་ལས་ཐམས་ཅད་འབྱུང་། །
en: “ ‘The abundance of colors, shapes, castes, Births, classes, and sounds All appear from the knowledge of omniscient wisdom.

source: གང་དག་ཡོན་ཏན་གཞན་ནི་ངས་མ་བསྟན། །
en: There are also other qualities that I have not spoken of.

source: ཐམས་ཅད་མཁྱེན་པའི་ཐུགས་ལས་ཀུན་འབྱུང་སྟེ། །
en: “ ‘Still, all of these appear to the omniscient mind.

source: ཇི་ལྟར་བྱང་ཆུབ་བྱེད་པའི་སེམས་སྐྱེས་ཤིང་། །བྱང་ཆུབ་སེམས་དཔས་སྟོབས་ཀུན་ཐོབ་པར་འགྱུར། །
en: So how does a bodhisattva arouse The resolve to awaken and achieve all the powers?’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐར་འོད་ཀྱིས་གཞོན་ནུ་སྙིང་རྗེ་ཅན་གྱི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་འཛུམ་པ་མཛད་དོ། །
en: “Aware of what Prince Kāruṇika had in mind, the thus-gone, worthy, perfect buddha Jyotiṣprabhā smiled.

source: དེ་ནས་གཞོན་ནུ་སྙིང་རྗེ་ཅན་གྱིས་འཛུམ་པ་མཛད་པར་རིག་ནས་སངས་རྒྱས་སུ་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་ལེགས་པར་བཏབ་ནས།
en: Noticing the smile, Prince Kāruṇika prayed, ‘May I attain buddhahood!’ and

source: དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཚིགས་སུ་བཅད་པས་ཞུ་བ་ཞུས་པ།
en: then asked the Thus-Gone One in verse:

source: འཇིག་རྟེན་ཕན་མཛད་འཛུམ་པ་གང་། །མགོན་པོ་བདག་ལ་དེ་ལུང་སྟོན། །འགྲོ་བ་གང་དག་ཐོས་ནས་དག །མཚུངས་མེད་རང་བྱུང་དག་ཏུ་འགྱུར། །
en: “ ‘Guardian whose smile benefits the world, Please grant me prophecy So that anyone who hears it Will become a peerless self-arisen one.

source: རྐང་གཉིས་དབང་པོ་ཁྱོད་འཁོར་འདི། །མི་ཡི་སེང་གེའི་ལྷ་ལ་བལྟ། །རྒྱལ་བའི་ལུང་སྟོན་ནོད་པ་ལགས། །མི་མཆོག་གསུངས་ཤིག་ཐེ་ཚོམ་སོལ། །
en: “ ‘Lord of men, looking at your retinue Of divine beings, lions among men, Supreme among men, please speak and dispel my doubts, That they may receive prophesies.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་སྐར་འོད་ཀྱིས་རྒྱལ་པོ་ཤིན་ཏུ་གནས་པ་དེ་དང་། སྲོག་ཆགས་ཁྲི་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: “Then the thus-gone named Jyotiṣprabhā bestowed prophesies in the presence of King Susthita and the entire retinue of six hundred thousand beings.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་གཞོན་ནུ་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་ཐེ་ཙོམ་འམ། ཡིད་གཉིས་ཟ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may have any doubts or reservations, thinking that at that time Prince Kāruṇika was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was Prince Kāruṇika.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པར་བྱའོ། །
en: For this reason, Maudgalyāyana, bodhisattvas should gain knowledge of all treatises.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཞུགས་པར་འགྱུར་རོ། །
en: Maudgalyāyana, bodhisattvas who are knowledgeable about all treatises enter into the state of omniscience.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྩོམ་པ་འདི་ནི་འདི་ལྟ་སྟེ། བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པའོ། །
en: It is because making a composition about omniscient wisdom means to be knowledgeable about all treatises.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པ་ནི་བསྟན་བཅོས་བྱེད་པ་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རྗེས་སུ་འགྲོ་བར་འགྱུར་ཏེ། །
en: Maudgalyāyana, bodhisattvas who are knowledgeable about all treatises come to take on the disposition of the authors of those treatises.

source: ངོ་བོ་ཉིད་འདིས་བསྟན་བཅོས་དེ་སྟོན་ཏོ་
en: By this identity they teach the treatises.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཁམས་དུ་མ་མཁྱེན་པ་འགོག་པར་འགྱུར་བའི་ལམ་མཁྱེན་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རིག་པར་བྱ་སྟེ།
en: You should know that in this regard the Thus-Gone One’s knowledge of the path that leads to cessation as related to knowledge of the several elements refers to omniscience.

source: ལས་ལས་ཉོན་མོངས་པ་རྗེས་སུ་དཔག་སྟེ།
en: Afflictions can be inferred from the presence of karma.

source: ཉོན་མོངས་པ་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས།
en: Due to these afflictions further karma is formed.

source: ཉོན་མོངས་པ་ལས་སེམས་རྗེས་སུ་དཔག་སྟེ།
en: Mind can be inferred from the presence of the afflictions.

source: ཉོན་མོངས་པ་རབ་ཏུ་སྤྱོད་པས་ཆགས་པའམ། སྡང་བའམ་རྨོངས་པའི་སེམས་རྗེས་སུ་དཔག་གོ། །
en: Due to the presence of involvement in afflictions, one can infer the presence of mind that is attached, angry, or deluded.

source: སེམས་ལས་གང་ཟག་འབྱུང་བར་རྗེས་སུ་དཔག་སྟེ།
en: Based on the presence of mind one can infer the presence of the person.

source: དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་འགྲོ་བ་འདོགས་པར་མཛད་དོ། །
en: In this way the Thus-Gone One declares sentient beings’ transmigrations.

source: གང་ཟག་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས་པས། དེ་སེམས་ཅན་དམྱལ་བར་འགྲོའོ། །
en: For instance, ‘Because of creating this karma, this individual will transmigrate as a hell being.’

source: གང་ཟག་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས་པས། དེ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་འགྲོའོ། །
en: Or, ‘Because of creating this karma, this individual will transmigrate to be born as an animal.’

source: གང་ཟག་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས་པས། དེ་གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོའོ། །
en: Or, ‘Because of creating this karma, this individual will transmigrate to the realm of the Lord of Death.’

source: གང་ཟག་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས་པས་དེ་ལྷ་མ་ཡིན་གྱི་རིས་སུ་འགྲོའོ། །
en: Or, ‘Because of creating this karma, this individual will transmigrate into the class of demigods.’

source: གང་ཟག་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས་པས་དེ་མིར་འགྲོའོ། །
en: Or, ‘Because of creating this karma, this individual will transmigrate as a human.’

source: གང་ཟག་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས་པས་དེ་མཐོ་རིས་སུ་འགྲོའོ། །
en: Or, ‘Because of creating this karma, this individual will transmigrate to the higher realms.’

source: གང་ཟག་འདིས་ལས་འདི་མངོན་པར་འདུས་བྱས་པས་དེ་མྱ་ངན་ལས་འདས་པར་འགྲོའོ། །
en: Or, ‘Because of creating this karma, this individual will transmigrate to nirvāṇa.’
